{
  "stringmaster": {
    "name": "Stringmaster",
    "description": "Увеличивает урон всех свойств резонанса на 12-24%. Попадание навыком резонанса по врагу повысит силу атаки на 12-24%, таким образом можно получить до 2 стаков. Когда владелец не находится на поле, его атака повышается на дополнительные 12-24%."
  },
  "cosmicRipples": {
    "name": "Cosmic Ripples",
    "description": "Восстановление энергии повышается на 12,8-25,6%. Когда владелец попадает по врагу базовым ударом, бонус урона этого типа увеличивается на 3,2-6,4%, складываясь до 5 раз. Этот эффект длится 8 секунд и срабатывает 1 раз в 0,5 секунд."
  },
  "variation": {
    "name": "Variation",
    "description": "После использования навыка резонанса восстанавливает энергию Концерта в размере 8-16 единиц. Данный эффект может сработать 1 раз в 20 секунд."
  },
  "augment": {
    "name": "Augment",
    "description": "При активации Резонансного освобождения сила атаки повышается на 15-48%. Эффект длится 15 секунд."
  },
  "jinzhouKeeper": {
    "name": "Jinzhou Keeper",
    "description": "Когда срабатывает Интро навык, сила атаки повышает на 8-16% и здоровье на 10-20%. Эффект продолжается 15 секунд."
  },
  "rectifierOfVoyager": {
    "name": "Rectifier of Voyager",
    "description": "После использования навыка резонанса восстанавливает энергию резонанса на 8-12 единиц. Данный эффект может сработать 1 раз в 20 секунд."
  },
  "guardianRectifier": {
    "name": "Guardian Rectifier",
    "description": "Бонус урона базовой и тяжелой атаки повышается на 12-24%."
  },
  "agesOfHarvest": {
    "name": "Ages of Harvest",
    "description": "Дает 12%-24% бонус всего элементального урона. За каждую базовую атаку дает 1 Благословение Веков, суммирующееся до 4 раз и пропадающее после выхода из боя. Накопив 4 или более стаков, носитель оружия поглощает их и повышает урон навыка резонанса на 48%-96% на 2.5 сек. Эффект срабатывает раз в 6 сек."
  },
  "verdantSummit": {
    "name": "Verdant Summit",
    "description": "Увеличивает урон всех свойств Резонанса на 12-24%. Активация Интро Скилла или Освобождения резонанса увеличивает урон тяжелой атаки на 24-48%. Эффект складывается до 2 раз и длится 14 сек."
  },
  "lustrousRazor": {
    "name": "Lustrous Razor",
    "description": "Восстановление энергии повышается на 12,8-25,6%. Активация Навыка резонанса увеличивает урон Резонансного освобождения на 7-14%. Эффект складывается до 3 раз и длится 12 сек."
  },
  "autumntrace": {
    "name": "Autumntrace",
    "description": "Когда базовая атака или тяжелая атака наносит урон сила атаки повышается на 4-12,8%, складывается до 5 раз. Эффект длится 7 сек. и может возникнуть не чаще 1 раза за 1 сек."
  },
  "heliosCleaver": {
    "name": "Helios Cleaver",
    "description": "В течение 12 сек. после активации Навыка резонанса сила атаки повышается на 3-6% каждые 2 сек., складывается до 4 раз. Как только число стаков достигнет 12, эффект сбрасывается в течение 1 сек."
  },
  "broadblade41": {
    "name": "Broadblade#41",
    "description": "Когда HP Резонатора выше 80%, сила атаки повышается на 12%. Если HP Резонатора ниже 40-80%, попадания базовой атакой и тяжелой атакой восстанавливают 5-10% HP. Эффект срабатывает не чаще 1 раза в 8 сек."
  },
  "broadbladeOfNight": {
    "name": "Broadblade of Night",
    "description": "После активации Интро скилла сила атаки повышается на 8-16% на 10 сек."
  },
  "veritysHandle": {
    "name": "Verity's Handle",
    "description": "Повышает элементальный урон на 12%-24%. После использования освобождения резонанса увеличивает урон от него же на 48%-96% на 8 сек. При использовании навыка резонанса длительность эффекта продлевается на 5 сек. Повышение длительности можно вызвать до 3 раз."
  },
  "abyssSurges": {
    "name": "Abyss Surges",
    "description": "Восстановление энергии повышается на 12.8-25.6%. Когда противник получает урон навыком резонанса, бонус урона обычной атаки повышается на 10-20% на 8 сек. Когда базовый удар попадает по врагу, бонус урона навыка резонанса увеличивается на 10-20% на 8 сек."
  },
  "stonard": {
    "name": "Stonard",
    "description": "После использования навыка резонанса повышает урон резонансного освобождения на 18%-54% в течение 15 сек."
  },
  "hollowMirage": {
    "name": "Hollow mirage",
    "description": "Когда используется освобождение резонанса, дает 3 стака Железной брони. Каждый стак повышает силу атаки и защиту на 3%-5%, эффект складывается до 3 раз. Когда резонатор получает урон, количество стаков уменьшается на 1."
  },
  "gauntlets21D": {
    "name": "Gauntlets#21D",
    "description": "Когда резонатор совершает рывки или увороты, его атака повышается 8%-16%. Повышает урон контратак на 50%-100% на 8 сек. После проведения контратаки раз в 6 сек. восстанавливает HP резонатора в количестве 5%-10%."
  },
  "gauntletsOfNight": {
    "name": "Gauntlets of Night",
    "description": "Когда резонатор выполняет Интро навык, повышает силу атаки на 8%-16% на 10 сек."
  },
  "marcato": {
    "name": "Marcato",
    "description": "После использования навыка резонанса, повышает энергию Концерта на 8-16 ед. Эффект может возникнуть раз в 20 сек."
  },
  "amityAccord": {
    "name": "Amity Accord",
    "description": "После использования Интро навыка повышает урон освобождения резонанса на 20%-40% на 15 сек."
  },
  "blazingBrilliance": {
    "name": "Blazing Brilliance",
    "description": "Повышает силу атаки на 12%-24%. После нанесения урона дает 1 стак Обжигающего Пера раз в 0.5 сек. После использования навыка резонанса дается 5 стаков Обжигающего Пера. Каждый стак повышает урон навыка резонанса на 4%-8%. Эффект складывается до 14 раз и длится 10 сек."
  },
  "emeraldOfGenesis": {
    "name": "Emerald of Genesis",
    "description": "Повышает восстановление энергии на 12,8-25,6%. При использовании навыка сила атаки увеличивается на 6-12%. Эффект складывается до 2-х раз и длится 10 секунд."
  },
  "commandoOfConviction": {
    "name": "Commando of Conviction",
    "description": "Когда активируется Интро навык, сила атаки повышается на 15-30% в течение 15 секунд."
  },
  "lunarCutter": {
    "name": "Lunar Cutter",
    "description": "Владелец при вступлении в бой получает 6 уровней статуса Клятва. Каждый стак повышает силу атаки на 2-4%, складывается до 6 раз. Эффект срабатывает 1 раз в 12 секунд. Каждые 2 секунды количество стаков уменьшается на 1. Владелец получает дополнительные 6 уровней после победы над врагом."
  },
  "scaleSlasher": {
    "name": "Scale Slasher",
    "description": "При использовании навыка резонанса восстанавливается 8-16 единиц энергии Концерта. Эффект срабатывает 1 раз в 20 секунд."
  },
  "lumingloss": {
    "name": "Lumingloss",
    "description": "При использовании навыка урон базовой и тяжелой атаки повышается на 20-64%, складываясь до 1-го раза. Эффект длится 10 секунд и срабатывает 1 раз в секунду."
  },
  "swordOfNight": {
    "name": "Sword of Night",
    "description": "Когда активируется Интро навык, сила атаки повышается на 8-16% в течение 10 секунд."
  },
  "swordOfVoyager": {
    "name": "Sword of Voyage",
    "description": "После использования навыка резонанса восстанавливает 8-12 ед. энергии резонанса. Эффект срабатывает 1 раз в 20 сек."
  },
  "staticMist": {
    "name": "Static Mist",
    "description": "Повышает восстановление энергии на 12.8%-25.6%. После использования Аутро навыка повышает атаку персонажа, на которого было выполнено переключение, на 10%-20% раз в 14 сек."
  },
  "novaburst": {
    "name": "Novaburst",
    "description": "После ускорения или уклонения повышает силу атаки на 4%-8% на 8 сек. Эффект складывается до 3 раз."
  },
  "undyingFlame": {
    "name": "Undying Flame",
    "description": "После использования Интро скилла повышает урон навыка резонанса на 20%-40% на 15 сек."
  },
  "pistols26": {
    "name": "Pistols#26",
    "description": "Когда резонатор не получает урон, атака повышается на 6%-12% каждые 5 сек. Эффект складывается до 2 раз и длится 8 сек. При получении урона стаки уменьшаются на 1, а резонатор восстанавливает 5%-10% HP."
  },
  "thunderbolt": {
    "name": "Thunderbolt",
    "description": "После попадания по цели обычной или тяжелой атакой урон навыка резонанса повышается на 7%-23%. Эффект может возникнуть раз в секунду, длится 10 сек. и складывается до 3 раз."
  },
  "cadenza": {
    "name": "Cadenza",
    "description": "Восстанавливает 8-16 ед. энергии концерта после использования навыка резонанса. Эффект возникает раз в 20 сек."
  },
  "pistolsOfNight": {
    "name": "Pistols of Night",
    "description": "Повышает силу атаки на 8%-16% после использования Интро навыка."
  },
  "pistolsOfVoyager": {
    "name": "Pistols of Voyager",
    "description": "Восстанавливает энергию резонанса на 8-12 ед. после активации навыка резонанса. Эффект срабатывает раз в 20 сек."
  }
}
